examples/openfoam/CollapseExample/constant/transportProperties

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

continuousPhaseName fluid;

rho.fluid         1167; 
partDensity       2178; 


transportModel  Newtonian;
nu              29.1e-06;

// ************************************************************************* //
